#### Pandas Tutorial - Part 64: DataFrame Methods (rdiv, reset_index, rfloordiv)

This notebook covers three important DataFrame methods:
- `rdiv()` - Get Floating division of dataframe and other, element-wise (binary operator rtruediv)
- `reset_index()` - Reset the index of the DataFrame
- `rfloordiv()` - Get Integer division of dataframe and other, element-wise (binary operator rfloordiv)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Set display options
pd.set_option('display.max_columns', None)
pd.set_option('display.expand_frame_repr', False)

##### 1. DataFrame.rdiv()

The `rdiv()` method performs floating division of other by dataframe, element-wise. It's equivalent to `other / dataframe`. This is the reverse version of `div()` or `truediv()`.

In [2]:
# Create a DataFrame
df = pd.DataFrame({
    'angles': [0, 3, 4],
    'degrees': [360, 180, 360]
}, index=['circle', 'triangle', 'rectangle'])

print("Original DataFrame:")
df

Original DataFrame:

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [3]:
# Regular division (df / 10)
print("Regular division (df / 10):")
df.div(10)

Regular division (df / 10):

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [4]:
# Reverse division (10 / df)
print("Reverse division (10 / df):")
df.rdiv(10)

Reverse division (10 / df):

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [5]:
# Equivalent operation using the division operator
print("Equivalent operation (10 / df):")
10 / df

Equivalent operation (10 / df):

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [6]:
# Create a DataFrame with NaN values
df_with_nan = pd.DataFrame({
    'A': [1, 2, np.nan],
    'B': [np.nan, 5, 6]
})

print("DataFrame with NaN values:")
df_with_nan

DataFrame with NaN values:

     A    B
0  1.0  NaN
1  2.0  5.0
2  NaN  6.0

In [7]:
# Reverse division with fill_value
print("Reverse division with fill_value=1:")
df_with_nan.rdiv(10, fill_value=1)

Reverse division with fill_value=1:

      A          B
0  10.0  10.000000
1   5.0   2.000000
2  10.0   1.666667

In [8]:
# Division with another DataFrame
other_df = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [40, 50, 60]
})

print("Other DataFrame:")
print(other_df)

print("\nReverse division (other_df / df_with_nan):")
df_with_nan.rdiv(other_df)

Other DataFrame:
    A   B
0  10  40
1  20  50
2  30  60

Reverse division (other_df / df_with_nan):

      A     B
0  10.0   NaN
1  10.0  10.0
2   NaN  10.0

In [9]:
# Division with Series
s = pd.Series([10, 20, 30])
print("Series:")
print(s)

print("\nReverse division along index (s / df_with_nan):")
df_with_nan.rdiv(s, axis=0)

Series:
0    10
1    20
2    30
dtype: int64

Reverse division along index (s / df_with_nan):

      A    B
0  10.0  NaN
1  10.0  4.0
2   NaN  5.0

##### 2. DataFrame.reset_index()

The `reset_index()` method resets the index of the DataFrame, and uses the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels.

In [10]:
# Create a DataFrame with a simple index
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': ['a', 'b', 'c', 'd']
}, index=['w', 'x', 'y', 'z'])

print("DataFrame with simple index:")
df

DataFrame with simple index:

   A  B
w  1  a
x  2  b
y  3  c
z  4  d

In [11]:
# Reset index (default: drop=False)
print("Reset index (drop=False):")
df.reset_index()

Reset index (drop=False):

  index  A  B
0     w  1  a
1     x  2  b
2     y  3  c
3     z  4  d

In [12]:
# Reset index with drop=True
print("Reset index (drop=True):")
df.reset_index(drop=True)

Reset index (drop=True):

   A  B
0  1  a
1  2  b
2  3  c
3  4  d

In [13]:
# Create a DataFrame with MultiIndex
index = pd.MultiIndex.from_tuples([
    ('bird', 'falcon'),
    ('bird', 'parrot'),
    ('mammal', 'lion'),
    ('mammal', 'monkey')
], names=['class', 'name'])

columns = pd.MultiIndex.from_tuples([
    ('speed', 'max'),
    ('species', 'type')
])

df_multi = pd.DataFrame([
    [389.0, 'fly'],
    [24.0, 'fly'],
    [80.5, 'run'],
    [np.nan, 'jump']
], index=index, columns=columns)

print("DataFrame with MultiIndex:")
df_multi

DataFrame with MultiIndex:

               speed species
                 max    type
class  name
bird   falcon  389.0     fly
       parrot   24.0     fly
mammal lion     80.5     run
       monkey    NaN    jump

In [14]:
# Reset all levels of the index
print("Reset all levels of the index:")
df_multi.reset_index()

Reset all levels of the index:

    class    name  speed species
                     max    type
0    bird  falcon  389.0     fly
1    bird  parrot   24.0     fly
2  mammal    lion   80.5     run
3  mammal  monkey    NaN    jump

In [15]:
# Reset a specific level of the index
print("Reset only the 'class' level:")
df_multi.reset_index(level='class')

Reset only the 'class' level:

         class  speed species
                  max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [16]:
# Reset a specific level with col_level
print("Reset 'class' level with col_level=1:")
df_multi.reset_index(level='class', col_level=1)

Reset 'class' level with col_level=1:

                speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [17]:
# Reset a specific level with col_level and col_fill
print("Reset 'class' level with col_level=1 and col_fill='species':")
df_multi.reset_index(level='class', col_level=1, col_fill='species')

Reset 'class' level with col_level=1 and col_fill='species':

       species  speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [18]:
# Reset a specific level with a nonexistent col_fill
print("Reset 'class' level with col_level=1 and nonexistent col_fill='genus':")
df_multi.reset_index(level='class', col_level=1, col_fill='genus')

Reset 'class' level with col_level=1 and nonexistent col_fill='genus':

         genus  speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [20]:
# Reset index with a custom name
print("Reset index with a custom name:")
df.reset_index(names=['letter'])

Reset index with a custom name:

  letter  A  B
0      w  1  a
1      x  2  b
2      y  3  c
3      z  4  d

##### 3. DataFrame.rfloordiv()

The `rfloordiv()` method performs integer division of other by dataframe, element-wise. It's equivalent to `other // dataframe`. This is the reverse version of `floordiv()`.

In [21]:
# Create a DataFrame
df = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [3, 5, 7]
})

print("Original DataFrame:")
df

Original DataFrame:

    A  B
0  10  3
1  20  5
2  30  7

In [22]:
# Regular integer division (df // 3)
print("Regular integer division (df // 3):")
df.floordiv(3)

Regular integer division (df // 3):

    A  B
0   3  1
1   6  1
2  10  2

In [23]:
# Reverse integer division (100 // df)
print("Reverse integer division (100 // df):")
df.rfloordiv(100)

Reverse integer division (100 // df):

    A   B
0  10  33
1   5  20
2   3  14

In [24]:
# Equivalent operation using the floor division operator
print("Equivalent operation (100 // df):")
100 // df

Equivalent operation (100 // df):

    A   B
0  10  33
1   5  20
2   3  14

In [25]:
# Create a DataFrame with NaN values
df_with_nan = pd.DataFrame({
    'A': [10, 20, np.nan],
    'B': [np.nan, 5, 7]
})

print("DataFrame with NaN values:")
df_with_nan

DataFrame with NaN values:

      A    B
0  10.0  NaN
1  20.0  5.0
2   NaN  7.0

In [26]:
# Reverse integer division with fill_value
print("Reverse integer division with fill_value=1:")
df_with_nan.rfloordiv(100, fill_value=1)

Reverse integer division with fill_value=1:

       A      B
0   10.0  100.0
1    5.0   20.0
2  100.0   14.0

In [27]:
# Integer division with another DataFrame
other_df = pd.DataFrame({
    'A': [100, 200, 300],
    'B': [400, 500, 600]
})

print("Other DataFrame:")
print(other_df)

print("\nReverse integer division (other_df // df_with_nan):")
df_with_nan.rfloordiv(other_df)

Other DataFrame:
     A    B
0  100  400
1  200  500
2  300  600

Reverse integer division (other_df // df_with_nan):

      A      B
0  10.0    NaN
1  10.0  100.0
2   NaN   85.0

In [28]:
# Compare rdiv and rfloordiv
value = 100
print(f"Comparing rdiv and rfloordiv with {value}:")
print(f"\nrdiv ({value} / df):")
print(df.rdiv(value))
print(f"\nrfloordiv ({value} // df):")
print(df.rfloordiv(value))

Comparing rdiv and rfloordiv with 100:

rdiv (100 / df):
           A          B
0  10.000000  33.333333
1   5.000000  20.000000
2   3.333333  14.285714

rfloordiv (100 // df):
    A   B
0  10  33
1   5  20
2   3  14

##### Summary

In this notebook, we've explored three important DataFrame methods:

1. **rdiv()**: Performs floating division of other by dataframe, element-wise. It's equivalent to `other / dataframe`. This is the reverse version of `div()` or `truediv()`. The method supports filling missing values with the `fill_value` parameter.

2. **reset_index()**: Resets the index of the DataFrame, and uses the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels. Key parameters include:
   - `drop`: Whether to drop the index columns or insert them into the DataFrame
   - `level`: Only remove the given levels from the index
   - `col_level`: If the columns have multiple levels, determines which level the labels are inserted into
   - `col_fill`: If the columns have multiple levels, determines how the other levels are named

3. **rfloordiv()**: Performs integer division of other by dataframe, element-wise. It's equivalent to `other // dataframe`. This is the reverse version of `floordiv()`. Like `rdiv()`, it supports filling missing values with the `fill_value` parameter.

These methods are essential for various data manipulation tasks in pandas, including arithmetic operations and index management.